Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-DA_DFP/1.3.111/atdf/PIC32MZ2064DAL169.atdf
      <value-group caption="Upper Boot Alias Page 3 Write-protect bit" name="NVMBWP__UBWP3">
         <value caption="Write protection for physical address 0x01FC2C000 through 0x1FC2FFFF enabled" name="" value="0x1" />
         <value caption="Write protection for physical address 0x01FC2C000 through 0x1FC2FFFF disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Upper Boot Alias Page 4 Write-protect bit" name="NVMBWP__UBWP4">
         <value caption="Write protection for physical address 0x01FC30000 through 0x1FC33FFF enabled" name="" value="0x1" />
         <value caption="Write protection for physical address 0x01FC30000 through 0x1FC33FFF disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Upper Boot Alias Write-protect Unlock bit" name="NVMBWP__UBWPULOCK">
         <value caption="UBWPx bits are not locked and can be modified" name="" value="0x0" />
         <value caption="UBWPx bits are locked and cannot be modified" name="" value="0x0" />
      </value-group>
      <value-group caption="Lower Boot Alias Page 0 Write-protect bit" name="NVMBWP__LBWP0">
         <value caption="Write protection for physical address 0x01FC00000 through 0x1FC03FFF enabled" name="" value="0x0" />
         <value caption="Write protection for physical address 0x01FC00000 through 0x1FC03FFF disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Lower Boot Alias Page 1 Write-protect bit" name="NVMBWP__LBWP1">
         <value caption="Write protection for physical address 0x01FC04000 through 0x1FC07FFF enabled" name="" value="0x0" />
         <value caption="Write protection for physical address 0x01FC04000 through 0x1FC07FFF disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Lower Boot Alias Page 2 Write-protect bit" name="NVMBWP__LBWP2">
         <value caption="Write protection for physical address 0x01FC08000 through 0x1FC0BFFF enabled" name="" value="0x0" />
         <value caption="Write protection for physical address 0x01FC08000 through 0x1FC0BFFF disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Lower Boot Alias Page 3 Write-protect bit" name="NVMBWP__LBWP3">
         <value caption="Write protection for physical address 0x01FC0C000 through 0x1FC0FFFF enabled" name="" value="0x0" />
         <value caption="Write protection for physical address 0x01FC0C000 through 0x1FC0FFFF disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Lower Boot Alias Page 4 Write-protect bit" name="NVMBWP__LBWP4">
         <value caption="Write protection for physical address 0x01FC10000 through 0x1FC13FFF enabled" name="" value="0x0" />
         <value caption="Write protection for physical address 0x01FC10000 through 0x1FC13FFF disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Lower Boot Alias Write-protect Unlock bit" name="NVMBWP__LBWPULOCK">
         <value caption="LBWPx bits are not locked and can be modified" name="" value="0x2" />
         <value caption="LBWPx bits are locked and cannot be modified" name="" value="0x0" />
      </value-group>
      <value-group caption="Flash Memory Swap Lock Control bits" name="NVMCON2__SWAPLOCK">
         <value caption="PFSWAP and BFSWAP are not writable and SWAPLOCK is not writable" name="" value="0x3" />
         <value caption="PFSWAP and BFSWAP are not writable and SWAPLOCK is writable" name="" value="0x2" />
         <value caption="PFSWAP and BFSWAP are not writable and SWAPLOCK is writable" name="" value="0x1" />
         <value caption="PFSWAP and BFSWAP are writable and SWAPLOCK is writable" name="" value="0x0" />
      </value-group>
   </module>
   <module caption="" id="00749" name="OCMP" version="1">
      <register-group name="OCMP">
         <register caption="Output Compare 'x' Control Register" name="OC1CON" offset="0x0" rw="RW" size="4">
            <bitfield caption="Output Compare Mode Select bits" mask="0x00000007" name="OCM" values="OC1CON__OCM" />
            <bitfield caption="Output Compare Timer Select bit" mask="0x00000008" name="OCTSEL" values="OC1CON__OCTSEL" />
            <bitfield caption="PWM Fault Condition Status bit" mask="0x00000010" name="OCFLT" values="OC1CON__OCFLT" />
            <bitfield caption="32-bit Compare Mode bit" mask="0x00000020" name="OC32" values="OC1CON__OC32" />
            <bitfield caption="Stop in Idle Mode bit" mask="0x00002000" name="SIDL" values="OC1CON__SIDL" />
            <bitfield caption="Output Compare Peripheral On bit" mask="0x00008000" name="ON" values="OC1CON__ON" />
         </register>
         <register caption="Output Compare 'x' Control Register" name="OC2CON" offset="0x200" rw="RW" size="4">
            <bitfield caption="Output Compare Mode Select bits" mask="0x00000007" name="OCM" values="OC2CON__OCM" />
            <bitfield caption="Output Compare Timer Select bit" mask="0x00000008" name="OCTSEL" values="OC2CON__OCTSEL" />
            <bitfield caption="PWM Fault Condition Status bit" mask="0x00000010" name="OCFLT" values="OC2CON__OCFLT" />
            <bitfield caption="32-bit Compare Mode bit" mask="0x00000020" name="OC32" values="OC2CON__OC32" />
            <bitfield caption="Stop in Idle Mode bit" mask="0x00002000" name="SIDL" values="OC2CON__SIDL" />
            <bitfield caption="Output Compare Peripheral On bit" mask="0x00008000" name="ON" values="OC2CON__ON" />
         </register>
         <register caption="Output Compare 'x' Control Register" name="OC3CON" offset="0x400" rw="RW" size="4">
            <bitfield caption="Output Compare Mode Select bits" mask="0x00000007" name="OCM" values="OC3CON__OCM" />
            <bitfield caption="Output Compare Timer Select bit" mask="0x00000008" name="OCTSEL" values="OC3CON__OCTSEL" />
            <bitfield caption="PWM Fault Condition Status bit" mask="0x00000010" name="OCFLT" values="OC3CON__OCFLT" />
            <bitfield caption="32-bit Compare Mode bit" mask="0x00000020" name="OC32" values="OC3CON__OC32" />
            <bitfield caption="Stop in Idle Mode bit" mask="0x00002000" name="SIDL" values="OC3CON__SIDL" />
            <bitfield caption="Output Compare Peripheral On bit" mask="0x00008000" name="ON" values="OC3CON__ON" />
         </register>
         <register caption="Output Compare 'x' Control Register" name="OC4CON" offset="0x600" rw="RW" size="4">
            <bitfield caption="Output Compare Mode Select bits" mask="0x00000007" name="OCM" values="OC4CON__OCM" />
            <bitfield caption="Output Compare Timer Select bit" mask="0x00000008" name="OCTSEL" values="OC4CON__OCTSEL" />
            <bitfield caption="PWM Fault Condition Status bit" mask="0x00000010" name="OCFLT" values="OC4CON__OCFLT" />
            <bitfield caption="32-bit Compare Mode bit" mask="0x00000020" name="OC32" values="OC4CON__OC32" />
            <bitfield caption="Stop in Idle Mode bit" mask="0x00002000" name="SIDL" values="OC4CON__SIDL" />
            <bitfield caption="Output Compare Peripheral On bit" mask="0x00008000" name="ON" values="OC4CON__ON" />
         </register>
